# GridNode Structure

---
A structure that represents a particular location in (U,V) from a grid.
SystemObject SystemValueType Autodesk.Revit.DBGridNode
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public struct GridNode

    Public Structure GridNode

    public value class GridNode

    [<SealedAttribute>]
    type GridNode =
        struct
            inherit ValueType
        end
The GridNode type exposes the following members.
| Name| Description
---|---|---
| GridNode| Initializes a new instance of the GridNode class
Top
| Name| Description
---|---|---
| UIndex| The node's index along the U axis.
| VIndex| The node's index along the V axis.
Top
| Name| Description
---|---|---
| Equals| Indicates whether this instance and a specified object are equal.(Inherited from ValueType)
| GetHashCode| Returns the hash code for this instance.(Inherited from ValueType)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns the fully qualified type name of this instance.(Inherited from ValueType)
Top
#### Reference
Autodesk.Revit.DB Namespace